<?php
$code = array(
    200=>'成功',
    //系统相关
    5000=>'默认值，未知错误',
    5001=>'此接口必须为登陆状态',
    5002=>'请求IP在黑名单中',
    5003=>'请求IP在短时间内，请求次数过于频繁',
    5005=>'curl错误',
    5006=>'发送短信-XX秒只能发送XX次',
    5007=>'发送短信-一天内只允许发送XX次',

    5008=>'发送短信-配置表里的短信内容为空',
    5009=>'发送短信-运营商发送失败',

    //用户相关
    6001=>'用户未登陆',
    6003=>'#name#号已注册',
    6004=>'用户在黑名单中',
    6101=>'用户在短时间内，请求次数过于频繁',



    //各种参数为空
    8000=>'cellphone(手机号为空)-为空',
    8001=>'ps(密码)-为空',
//    8002=>'token为空',
    8003=>'key为空',
    8004=>'type为空',
    8005=>'ruleId为空',
    8006=>'appid为空',//oauth
    8007=>'timestamp为空',
    8008=>'authentication为空',
    8008=>'imgCode为空',//图片验证码
    8009=>'name为空',
    8010=>'ps为空',
    8011=>'uniqueCode为空',
    8012=>'pic为空',
    8013=>'confimPs为空',
    8014=>'code为空',
    8015=>'addr为空',
    8016=>'userinfo为空',//用户于3方登陆、修改用户个人信息
    8017=>'上传图片 post input name 为空',
    8018=>'上传图片 内容 为空',

//    5003=>'token验证错误',
//    5004=>'key验证错误',
//    8005=>'登陆-无须重复登陆',

    //各种-数据格式-验证-错误
    8109=>'token解析失败',//
    8110=>'code验证失败',//
    8112=>'路径错误',
    8113=>'目录不是777',
    8114=>'图片大于2MB',
    8115=>'文件扩展名错误',
    8116=>'文件类型错误',
    8117=>'文件上传失败1',
    8118=>'文件上传失败2',

    8200=>'用户当前BOSS等级-大于-》BOSS最大级',
    8201=>'用户当前BOSS等级 小于 1级',
    8202=>'用户当前BOSS等级 已是最大级，不能再升级',
    8203=>'金币不足',
    8204=>'向日葵不足',


    //Db相关,也就是参数传过来的ID 到DB中查找不到
    1000=>'uid不在DB中',
    1001=>'ruleId不在DB中',
    1002=>'token解出的UID，未在DB中',
    1003=>'appid错误，不在DB中',
    1004=>'并没有发送过短信',
    1005=>'db status 状态已失效',
    1006=>'登陆用户不在DB中',
    1007=>'找回密码，地址不在DB中'


);
$GLOBALS['code'] = $code;